Revit 2027 API
IFCProductWrapper.Create(IFCProductWrapper) Method
 Establishes a new product manager for elements and objects derived from a parent product manager.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCProductWrapper Create(
	IFCProductWrapper pProductWrapper
)
Public Shared Function Create (
	pProductWrapper As IFCProductWrapper
) As IFCProductWrapper
public:
static IFCProductWrapper^ Create(
	IFCProductWrapper^ pProductWrapper
)
static member Create :
        pProductWrapper : IFCProductWrapper -> IFCProductWrapper
Parameters
pProductWrapper IFCProductWrapper
 The parent product manager.
Return Value
IFCProductWrapper
 The new product manager.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCProductWrapper Class
Create Overload
Autodesk.Revit.DB.IFC Namespace